src/main/resources/request/SendGenerateFolioContentRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:fol="http://schemas.consiliumtechnologies.com/mobile/2009/04/FolioMessages.xsd" xmlns:com="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendGenerateFolioContentRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:GenerateFolioContentRequest>
                <!--Optional:-->
                <fol:Guid>?</fol:Guid>
                <fol:User>
                    <!--Optional:-->
                    <com:Attributes>
                        <!--Zero or more repetitions:-->
                        <com:Attribute>
                            <!--Optional:-->
                            <com:Name>?</com:Name>
                            <!--Optional:-->
                            <com:Value>?</com:Value>
                        </com:Attribute>
                    </com:Attributes>
                    <!--Optional:-->
                    <com:ID>?</com:ID>
                    <!--Optional:-->
                    <com:Name>?</com:Name>
                    <!--Optional:-->
                    <com:DeviceID>?</com:DeviceID>
                </fol:User>
                <fol:Name>?</fol:Name>
                <fol:Metadata>
                    <!--Zero or more repetitions:-->
                    <com:Item>
                        <!--Optional:-->
                        <com:Name>?</com:Name>
                        <!--Optional:-->
                        <com:Value>?</com:Value>
                    </com:Item>
                </fol:Metadata>
                <fol:Push>?</fol:Push>
                <fol:Reference>?</fol:Reference>
                <fol:Provider>?</fol:Provider>
                <!--Optional:-->
                <fol:Parameters>
                    <!--Zero or more repetitions:-->
                    <com:Item>
                        <!--Optional:-->
                        <com:Name>?</com:Name>
                        <!--Optional:-->
                        <com:Value>?</com:Value>
                    </com:Item>
                </fol:Parameters>
            </mes:GenerateFolioContentRequest>
        </mes:SendGenerateFolioContentRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>